[
  {
    "title": "﻿One of Us Is Lying \r",
    "image": "/blogs/entertainment/1720958044873.png",
    "content": "<h2>One Of Us Is Lying - Karen McManus</h2> \r<br><br>All the crime - thriller lovers  out there, if your recent craving is for a moderately tongue clenching, lip parting and heart warming book to munch on ‘One Of Us Is Lying’ is the book that will satiate you just enough.\r<br><br>Life as it is, is cruel enough and a shade of that cruelty has been elegantly winded into a beautiful plot by author Karen through the lives of five high school students who are in that wobbly, indecisive explorative youth phase. Making decisions is a hard thing in that phase and making them right is an even bigger ordeal. And exactly that is the focus of this thriller. \r<br><br> It was probably an ordinary morning for Brownyn, Addy, Cooper and Nate at Bayview high, a prestigious school in their neighbourhood. Each had a seperate thing going on in their life. Brownyn was the class geek, brightest in the class and probably on the way to earning a full scholarship course in Yale University. Meanwhile, Addy, the school princess, literally the homecoming princess, just not the Queen of junior prom, is in a relationship with the homecoming prince, just not the King of junior prom. Match made in heaven you suppose, I definitely did. Cooper could be described as a model American: Tall, blonde hair, sculpted face, shredded body and of course a history of swooning woman at his sight. He was a pitcher in baseball, one trying to make it big at national levels and scouted by a lot of coaches. Nate had a world of his own, dealt drugs to make an earning because no one could do it for him, the earning I mean, father was a hopeless drunkard and mother was a drug addict herself with mental issues. Life was hard but he had a way of  barely skimming through it. They all  had a seemingly normal life, all until that one day which changed it all. Those four got detention with another boy. Simon, his name was. He ran a gossip app that revealed things about his classmates  that were better off a secret. Naturally, he became the most hated person in the class. Few minutes into detention, when the teacher is out of the room, Simon grabs a glass of water to drink, talks to the four getting either awkward or no answers. Suddenly he starts choking! The four of them try their best to help but he ends up dying on the way to hospital. Initially thought an accident, with police investigation turns murder!\r<br><br> If the questions in your head are “what!?  how!? Or just huh!?”  Grab yourselves a hot drink and settle with the book in a quiet corner as it unravels quite shockingly how the seemingly normal lives of those four had quirks of their own as the police attempt to investigate the mysterious death of Simon. Narrated in four different voices of Brownyn, Addy, Cooper and Nate puts the same plot in four different perspectives at the same time unravelling each one's personal life teasingly enough to keep you engaged all the while. Interesting book indeed, which you must definitely give a read.\r<br><br>P.S : The plot twist is not what you imagine *wink* . ENJOY READING!",
    "url": "/blogs/entertainment/1720958044871.html"
  },
  {
    "title": "﻿The Girl On The Train\r",
    "image": "/blogs/entertainment/1720958065622.png",
    "content": "<h2>The Girl On The Train - Paula Hawkins</h2>\r<br><br>            Life, men and women are probably those three things that fuss a lot. Never satisfied, never convinced and never really truthful. Some of that very fuss, that completely unnecessary, untimely and unwanted fuss is the central item around which this nail biting thriller wheels around. \r<br><br>            In this Paula’s first book, set around the London suburbs which couldn't have been more beautifully described than through the eyes of Rachel, a daily train commuter to London. A woman tired with her work, with life and with herself. Her tiredness due to her inability to bear a child. Tom, her husband supported her in all the ways he could but she couldn't come to terms with herself. She was upset, turned to drinking and became its frequent indulger. Each time with a more fierce hangover and a blanker hour of action, where she would do things that she couldn't believe she could do. Tom got tired of this and found another woman, more stable, more loving and younger to be showered with and shower love. Her name was Anna. Rachel's case worsened as she was bought off her own house and shooed away like she was nothing.\r<br><br>            With all this pent up frustration and anger, she put up a staright face and commuted for work by train, which by cruel play of life had to pass behind the backs of a row of houses, one of them being hers  - Anna’s now and her baby. But she was intersted about another house. A house whose occupants were  a beautiful couple so in love that reminded Rachel her old days with Tom. She didn't know them, but her daily travel to and fro just across their house made her feel she was connected to them, she felt obligated to protect that intimacy they shared. She gave them names that she seemed suited for them. Jason and Jess, she decided. But ofcourse in this fussy world, without a little fuss nothing runs, through the same window which showed Jess in her peaceful lovey dovey life, showed her kissing a complete stranger !! She felt sad but anger overtook soon. Why would Jess want to cheat when everything could'nt be more perfect in her life? She wanted to confront her that day. She thought drinking would give her more edge while confronting, but the next day she got up bruises on her arms and legs and with no memory as to what happened that night. Shockingly she realised that the same night was the night that Megan (Jess) went missing !!\r<br><br>         What happened that night? What did her memory betray her off? Was she involved or someone else? Her memory a complete haze unwilling to uncloud. She wanted to help, there was this involuntary need to do so. Guilt maybe? But of what?. She went to Scott (Jason) to tell him about what she knows and each visit clearing a part of the haze but causing problems with Anna and Tom. Anna being overly possessive over her new husband wants nothing to do with her ex, nor does she want her around the house. Those hazy memories slowly clearing, to reveal faces of Anna, Megan Tom and herself. So what actually happened that night? What happened to Megan? \r<br><br>            This book with its beautiful descriptions and wonderful character developments is a read you probably shouldn't miss. Narrated from voices of Rachel, Megan and Anna, three wildly contrasting yet emotionally similar people just his different when they are so harmoniously brought together by author Paula Hawkins. MUST READ INDEED !!",
    "url": "/blogs/entertainment/1720958065620.html"
  },
  {
    "title": "﻿The Royal Treatment \r",
    "image": "/blogs/entertainment/1720958091900.png",
    "content": "      Had a long week? Want something not too wild nor too sad, just something to lighten the mood with sweet feelings? We have got you covered.\r<br><br>        The Royal Treatment could be just the break you need. A rom-com in virtue with comedy being its major expression in the movie couldn't depict “life is as easy as you make it” more vibrantly. Dealing  with  feelings that people normally do feel and thankfully not having the slightest amount of cringe that is expected with rom-com movies, it was a pleasant watching experience. I would personally give it a 7/10. Rotten tomatoes give it a 5.6/10 but I recommend you figure that on your own.\r<br><br>         Not to spoil much but just to feed your curiosity that hopefully doesn't kill, the story revolves around a hair stylist , named Isabella (played by Laura Marano) Izzy for short who owns a salon in New York with her mother, her Nonna and friends. Budding as she is, her life seems to be the very opposite of her jolly character. Amidst all this worry and chaos, enters the charming prince Thomas (played by Mena Massoud) from Lavonia, who visits America to see to the arrangements made for his marriage with Laura  La Mott, the daughter of the La Motts. All he needed to do was to fix his hair. It's plenty  entertaining to watch the free ,wild  and chaotic life of Izzy meeting the rather dull, monotonic and suffocating life of Thomas colliding in an exciting  manner and the adventure they take on from there on.\r<br><br>        The spirited nature of Izzy is almost contagious and Marano's acting just made it more real. Prince Thomas's life could be relatable to some of us and Mena's acting just conveyed it all. All in all a very rounded movie with themes not just mainly focusing on love but with virtues like sharing and giving respect have also been touched upon.  The right kind of movie to momentarily jolt you from a busy working week for some good found entertainment.",
    "url": "/blogs/entertainment/1720958091899.html"
  }
]